<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Healthcare Services Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are for various messages related to healthcare services,
    | e.g., healthcare services search, healthcare services-related API request messages, etc.,
    |
    */

    'add' => 'Нова послуга',
    'for_division' => 'Для «:name»',
    'available_time' => 'Графік доступності',
    'providing_condition' => 'Умови надання послуги',
    'category' => 'Категорія послуги',
    'speciality_type' => 'Лікарська спеціальність',
    'type' => 'Тип медичної послуги',
    'license' => 'Ліцензія закладу',
    'all_day' => 'Цілодобово',
    'available_time_info' => "Всі дні з незаповненими даними автоматично отримують статус 'Не доступна'",
    'specialisation' => 'Спеціалізація',
    'status' => 'Статус послуги',
    'continue' => 'Продовжити створення послуги',
    'delete' => 'Видалити чернетку послуги',
    'add_non_working_hours' => 'Додати неробочий час',
    'start_non_working_time' => 'Початок неробочого часу',
    'end_non_working_time' => 'Кінець неробочого часу',
    'choose_time' => 'Оберіть час',
    'comment_non_working_hours' => 'Коментар до неробочого часу',
    'non_working_hours' => 'Неробочий час №',
    'available_time_attributes' => [
        'start_time' => 'час відчинення',
        'end_time' => 'час зачинення'
    ],
    'available_time_days' => [
        'mon' => 'понеділок',
        'tue' => 'вівторок',
        'wed' => 'середу',
        'thu' => 'четвер',
        'fri' => "п’ятницю",
        'sat' => 'суботу',
        'sun' => 'неділю'
    ],
    'available_time_error' => 'У :day: :message',
    'not_available_attributes' => [
        'start_date' => 'дата початку неробочого часу',
        'start_time' => 'час початку неробочого часу',
        'end_date' => 'дата кінця неробочого часу',
        'end_time' => 'час кінця неробочого часу',
        'description' => 'коментар до неробочого часу'
    ],
    'not_available_error' => 'Неробочий час №:position: :message',
    'service_search' => 'Пошук',

     // modals
    'modals' => [
        'activate' => [
            'title' => 'Підтвердження активації медичної послуги',
            'confirmation_text' => 'Ви впевнені, що хочете активувати цю послугу?',
        ],
        'deactivate' => [
            'title' => 'Підтвердження деактивації медичної послуги',
            'confirmation_text' => 'Ви впевнені, що хочете деактивувати цю послугу?',
        ],
        'delete' => [
            'title' => 'Підтвердження видалення чернетки',
            'confirmation_text' => 'Ви впевнені, що хочете видалити цю чернетку?',
        ],
    ],

    'success' => [
        'created' => 'Послугу успішно створено.',
        'draft_created' => 'Чернетку послуги успішно створено.',
        'updated' => 'Послугу успішно оновлено.',
        'activated' => 'Послугу успішно активовано',
        'deactivated' => 'Послугу успішно деактивовано',
        'draft_deleted' => 'Чернетку послуги успішно видалено',
        'sync_started' => 'Синхронізацію успішно розпочато.',
        'sync_updated' => 'Інформацію успішно оновлено'
    ],

    'policy' => [
        'create' => 'У вас немає дозволу на створення послуги',
        'edit' => 'У вас немає дозволу на редагування цієї послуги',
        'update' => 'У вас немає дозволу на оновлення послуги',
        'activate' => 'У вас немає дозволу на активування послуги',
        'deactivate' => 'У вас немає дозволу на деактивування послуги',
        'delete' => 'У вас немає дозволу на видалення заявки на створення послуги',
        'sync' => 'У вас немає дозволу на синхронізацію послуг'
    ],

    'error' => [
        'sync_failed' => 'Виникла помилка. Оновіть список місць надання послуг та спробуйте ще раз'
    ],

    'api_errors' => [
        'write_not_allowed' => "Для вашої ролі відсутній доступ до цього ресурсу. Необхідний доступ на створення/редагування медичної послуги/послуги охорони здоров’я",
        'read_not_allowed' => 'Для вашої ролі відсутній доступ до цього ресурсу. Необхідний доступ на перегляд медичних послуг',
        'invalid_legal_entity_status' => 'Недійсний статус юридичної особи',
        'legal_entity_type_not_allowed' => 'Даний тип юридичної особи не має права створювати/надавати медичні послуги',
        'division_must_be_active' => "Місце надання послуг (підрозділ закладу охорони здоров’я) повинно бути активним в системі",
        'division_of_another_legal_entity' => 'Місце надання послуг (підрозділ) має належати юридичній особі',
        'category_not_allowed_for_legal_entity_type' => 'Вказана категорія медичних послуг не дозволена для даного типу юридичної особи',
        'category_license_required' => "Категорія медичних послуг повинна мати пов’язану ліцензію",
        'license_not_allowed_for_category' => 'Ліцензія не повинна бути зазначена для цієї категорії медичних послуг',
        'license_not_found' => "Ліцензії для даного закладу охорони здоров’я не існує",
        'license_type_mismatch' => 'Тип ліцензії не відповідає категорії медичних послуг',
        'speciality_and_providing_condition_not_unique' => 'Комбінація місця надання послуг, категорії медичних послуг, спеціальності лікаря та умов надання медичних послуг має бути унікальною',
        'category_and_type_not_unique' => 'Комбінація місця надання послуг, категорії та типу медичних послуг має бути унікальною',
        'time_not_allowed_for_all_day' => 'Час відчинення та зачинення не потрібно вказувати для цілодобового графіка',
        'time_required_unless_all_day' => "Час відчинення та зачинення обов’язкові, якщо графік не цілодобовий",
        'status_cannot_be_updated' => 'Медичну послугу з таким статусом неможливо оновити',
        'status_cannot_be_deactivated' => 'Медичну послугу з таким статусом неможливо деактивувати',
        'status_cannot_be_activated' => 'Медичну послугу з таким статусом неможливо активувати'
    ],

    'validation' => [
        'speciality_type' => [
            'required_if' => 'Поле лікарська спеціальність є обов\'язковим для заповнення, коли категорія послуги є ліцензія на провадження господарської діяльності з медичної практики.',
            'prohibited_unless' => 'Поле лікарська спеціальність заборонено, якщо категорія послуги не є ліцензія на провадження господарської діяльності з медичної практики.',
        ],
        'providing_condition' => [
            'required_if' => 'Поле умови надання послуги є обов\'язковим для заповнення, коли категорія послуги є ліцензія на провадження господарської діяльності з медичної практики.',
            'prohibited_unless' => 'Поле умови надання послуги заборонено, якщо категорія послуги не є ліцензія на провадження господарської діяльності з медичної практики.',
        ],
        'type_coding' => [
            'required_if' => 'Поле тип медичної послуги є обов\'язковим для заповнення, коли категорія послуги є ліцензія на право провадження господарської діяльності з розроблення, виробництва, виготовлення, зберігання, перевезення, придбання, реалізації (відпуску) наркотичних засобів, психотропних речовин і прекурсорів.',
            'prohibited_unless' => 'Поле тип медичної послуги заборонено, якщо категорія послуги не є ліцензія на право провадження господарської діяльності з розроблення, виробництва, виготовлення, зберігання, перевезення, придбання, реалізації (відпуску) наркотичних засобів, психотропних речовин і прекурсорів.',
        ],
        'license_id' => [
            'required_if' => 'Поле ліцензія закладу є обов\'язковим для заповнення, коли категорія послуги пов\'язана з аптечною діяльністю.',
            'prohibited_if' => 'Поле ліцензія закладу заборонено, коли категорія послуги є ліцензія на провадження господарської діяльності з медичної практики.',
        ],
        'available_time' => [
            'end_after_start' => 'Час зачинення має бути пізніше за час відчинення.',
        ],
        'not_available' => [
            'end_after_start' => 'Кінець неробочого часу має бути пізніше за початок.',
            'end_date_after_start_date' => 'Дата кінця неробочого часу не може бути раніше за дату початку.',
        ],
    ],
];
