<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Licenses Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are for various messages related to licenses,
    | e.g., license search, license-related API request messages, etc.,
    |
    */

    'add' => 'Додати ліцензію',
    'create' => 'Нова ліцензія',
    'details' => 'Деталі ліцензії',
    'edit' => 'Редагувати ліцензію',
    'kind' => 'Вид ліцензії',
    'order_no' => 'Номер наказу',
    'activity' => 'Напрям діяльності',
    'number' => 'Серія та/або номер ліцензії',
    'what_licensed' => 'Напрям діяльності, що ліцензовано',
    'active_from_date_label' => 'Дата початку дії',
    'active_from_date' => 'Дата початку дії ліцензії',
    'primary' => 'Основна',
    'not_primary' => 'Додаткова',
    'issued_by' => 'Ким видано',
    'issued_date' => 'Дата видачі ліцензії',
    'expiry_date_label' => 'Дата завершення дії',
    'expiry_date' => 'Дата завершення дії ліцензії',

    'type' => [
        'label' => 'Тип ліцензії',
        'placeholder' => 'Оберіть тип ліцензії',
        'msp' => 'ліцензія на провадження господарської діяльності з медичної практики',
        'pharmacy' => 'ліцензія на провадження господарської діяльності з виробництва лікарських засобів, оптової та роздрібної торгівлі лікарськими засобами, імпорту лікарських засобів (крім активних фармацевтичних інгредієнтів)',
        'pharmacy_drugs' => 'ліцензія на право провадження господарської діяльності з розроблення, виробництва, виготовлення, зберігання, перевезення, придбання, реалізації (відпуску) наркотичних засобів, психотропних речовин і прекурсорів'
    ],

    'success' => [
        'created' => 'Ліцензія успішно створена',
        'updated' => 'Ліцензія успішно оновлена',
        'sync' => 'Ліцензії успішно синхронізовані з ЕСОЗ'
    ],

    'policy' => [
        'create' => 'У вас немає дозволу на створення ліцензії',
        'update' => 'У вас немає дозволу на оновлення ліцензії',
        'primary_not_editable' => 'Основну ліцензію не можна редагувати'
    ],

    'api_errors' => [
        'write_not_allowed' => 'Для вашої ролі відсутній доступ до цього ресурсу. Необхідний доступ на створення/редагування ліцензії',
        'read_not_allowed' => 'Для вашої ролі відсутній доступ до цього ресурсу. Необхідний доступ на отримання інформації про ліцензії',
        'invalid_legal_entity_status' => 'Юридична особа має бути в активному або призупиненому статусі',
        'only_additional_can_be_created' => 'Можна створити лише додаткову ліцензію',
        'only_additional_can_be_updated' => 'Оновлювати можна лише додаткову ліцензію',
        'active_primary_license_not_found' => 'Для юридичної особи не знайдено активної основної ліцензії',
        'type_already_present' => 'Ліцензія цього типу вже створена',
        'legal_entity_type_mismatch' => 'Тип ліцензії не відповідає типу юридичної особи',
        'expired' => 'Ліцензія втратила чинність',
        'issued_after_active_from' => 'Дата видачі ліцензії не може бути пізніше за дату початку дії',
        'active_from_after_expiry' => 'Дата початку дії ліцензії не може бути пізніше за дату завершення дії',
        'not_found' => 'Ліцензія не знайдена',
        'of_another_legal_entity' => 'Ліцензія не відповідає вашій юридичній особі',
        'cannot_change_to_primary' => 'Додаткову ліцензію не можна змінити на основну',
        'type_cannot_be_updated' => 'Тип ліцензії не можна оновити'
    ]
];
